Revit 2027 API
OffsetSurface.GetBasisSurface Method
 Returns a copy of basis surface of this OffsetSurface.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public Surface GetBasisSurface()
Public Function GetBasisSurface As Surface
public:
Surface^ GetBasisSurface()
member GetBasisSurface : unit -> Surface
Return Value
Surface
 Basis surface of this OffsetSurface.
See Also
Reference
OffsetSurface Class
Autodesk.Revit.DB Namespace